In [1]:
import pandas as pd
from scipy import stats
import matplotlib.pyplot as plt

In [7]:
df = pd.read_excel('Quality.xlsx')
df.head()

/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/openpyxl/worksheet/header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")

   Sample 1  Sample 2  Sample 3  Sample 4
0     11.55     11.62     11.91     12.02
1     11.62     11.69     11.36     12.02
2     11.52     11.59     11.75     12.05
3     11.75     11.82     11.95     12.18
4     11.90     11.97     12.14     12.11

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sample 1  30 non-null     float64
 1   Sample 2  30 non-null     float64
 2   Sample 3  30 non-null     float64
 3   Sample 4  30 non-null     float64
dtypes: float64(4)
memory usage: 1.1 KB

In [6]:
df.describe()

        Sample 1   Sample 2   Sample 3   Sample 4
count  30.000000  30.000000  30.000000  30.000000
mean   11.958667  12.028667  11.889000  12.081333
std     0.220356   0.220356   0.207171   0.206109
min    11.520000  11.590000  11.360000  11.640000
25%    11.812500  11.882500  11.752500  11.982500
50%    11.955000  12.025000  11.920000  12.080000
75%    12.145000  12.215000  11.997500  12.227500
max    12.320000  12.390000  12.220000  12.470000

In [9]:
sample = pd.concat([df['Sample 1'], df['Sample 2'], df['Sample 3'], df['Sample 4']]).reset_index(drop = True)

In [10]:
stats.ttest_1samp(sample, 12)

TtestResult(statistic=-0.5196355789314843, pvalue=0.6042828222996104, df=119)

## Cocacola

In [11]:
df = pd.read_excel("Coca_cola_use.xlsx", index_col= 'STT')
df.head()

     Ohio  Atlanta
STT
1    0.88     3.85
2    2.06     0.00
3    0.00     0.00
4    0.70     0.02
5    1.64     0.58

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 50 entries, 1 to 50
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Ohio     50 non-null     float64
 1   Atlanta  50 non-null     float64
dtypes: float64(2)
memory usage: 1.2 KB

In [19]:
ohio = df['Ohio']

In [20]:
atlanta = df['Atlanta']

In [21]:
stats.ttest_ind(ohio, atlanta, equal_var=False)

TtestResult(statistic=0.6129544104328379, pvalue=0.5413275550760535, df=97.91810815759084)